
## Plan Result (terraform/aws/external-secrets-operator)

[CI link](https://github.com/boxp/arch/actions/runs/8223226063)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy_attachment.external_secrets_policy_attachment
  * aws_iam_role.external_secrets_role
  * aws_iam_user.external_secrets_operator_user
  * aws_iam_user_policy_attachment.attach


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy_attachment.external_secrets_policy_attachment will be created
  + resource "aws_iam_policy_attachment" "external_secrets_policy_attachment" {
      + id         = (known after apply)
      + name       = "external-secrets-policy-attachment"
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + roles      = [
          + "external-secrets-role",
        ]
    }

  # aws_iam_role.external_secrets_role will be created
  + resource "aws_iam_role" "external_secrets_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-secrets-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_user.external_secrets_operator_user will be created
  + resource "aws_iam_user" "external_secrets_operator_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "exteral-secrets-operator-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.attach will be created
  + resource "aws_iam_user_policy_attachment" "attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "exteral-secrets-operator-user"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/aws/external-secrets-operator/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/22/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"c0600fa6111edc7a0c93f72c86c0ed851273d755","Target":"terraform/aws/external-secrets-operator","Vars":{},"WorkflowName":"pull_request_target"} -->